In [1]:
import pandas as pd

data = {
    'id' : [1,2,3],
    'name' : ['Choi', 'Lee', 'Kim'],
    'age' : [10,20,30],
    'assets' : [150.4, 123.4, 88.88],
    'job' : ['student', 'CEO', 'Dad']
}

df = pd.DataFrame(data)
df

   id  name  age  assets      job
0   1  Choi   10  150.40  student
1   2   Lee   20  123.40      CEO
2   3   Kim   30   88.88      Dad

In [2]:
df.sum()

id                    6
name         ChoiLeeKim
age                  60
assets           362.68
job       studentCEODad
dtype: object

In [3]:
df['assets'].sum()

362.68

In [4]:
df['assets'].mean()

120.89333333333333

In [5]:
df.describe()

        id   age      assets
count  3.0   3.0    3.000000
mean   2.0  20.0  120.893333
std    1.0  10.0   30.836507
min    1.0  10.0   88.880000
25%    1.5  15.0  106.140000
50%    2.0  20.0  123.400000
75%    2.5  25.0  136.900000
max    3.0  30.0  150.400000

In [7]:
import pandas as pd

df1 = pd.read_csv("ITrelatedWorkerStatus.csv", delimiter='\t')
df1

,Code,Classification,task,Number of employees (Unit: persons),Average age,Average career,Monthly average wage,Employment premium
0,AP,Web developer,Development,24500,31,4.0,3200000,128000
1,SD,System planning and design,plan,2450,35,9.0,3420000,137000
2,SA,SW manager,management,45000,34,5.5,2800000,112000
3,SD,Web designer,Development,54500,28,2.0,2500000,75000

1. 전체 평균 나이

In [8]:
df1['Average age'].mean()

32.0

2. 제일 많은 임금

In [9]:
df1['Monthly average wage'].max()

3420000

3. 가장 적은 경력으로 일할 수 있는 직종

In [12]:
index1 = df1['Average career'].idxmin()
df1.loc[index1]['Classification']

'Web designer'

4. 가장 많은 사람이 종사하는 직업

In [13]:
index1 = df1['Number of employees (Unit: persons)'].idxmax()
df1.loc[index1]['Classification']

'Web designer'